Islam-ElShahaby/STM32-G29/src/main.c
/**
 * G29 force-feedback over native USB OTG-FS host on the STM32 BlackPill.
 *
 * This file is the APPLICATION LAYER only — tasks, shared state, the CAN
 * frames, the wheel setup sequence and the console dispatch. The substance
 * lives in modules:
 *
 *   board.c       clock (84 MHz core / 48 MHz USB), LED, console UART
 *   log.c         non-blocking printf ring (a blocking printf ate a whole
 *                 control period, see log.h)
 *   g29_hid.c     custom USB-host HID class + force-feedback transport
 *   powertrain.c  engine + 8-speed automatic + reverse, and the speed-dependent
 *                 steering-feel physics. Pure integer maths, host-testable.
 *   steer_feel.c  the torque model: tyre scrub, damping, self-centring,
 *                 rumble, hands-on detection. Owns the wheel's single FFB
 *                 channel and arbitrates who drives it.
 *   bringup.c     FFB effect sweep + step-response identification ('S').
 *                 Measurement tools, not part of the control path.
 *   mcp2515.c     SPI-to-CAN (the F401 has no bxCAN peripheral)
 *
 * Data flow, once per 10 ms control tick:
 *
 *   wheel --USB--> control_task --pedals--> powertrain --speed--> steer_feel
 *                       |                       |                    |
 *                       |                       +-- rpm/gear ---+    +-- torque
 *                       +-------------------------------------- | ------> wheel
 *                                                              v
 *                                                  can_task --> 0x0A2/0A3
 *
 * Board: WeAct BlackPill STM32F401CEU6 (84 MHz max — NOT 96 MHz like the F411).
 * Console: USART1 on PA9 (TX) / PA10 (RX) at 115200, 8N1. Type '?' for knobs.
 * LED: PC13 (active low) blinks while idle, solid while the wheel is ready.
 */
#include "stm32f4xx_hal.h"
#include "board.h"
#include "log.h"
#include "steer_feel.h"
#include "usb_host.h"
#include "g29_hid.h"
#include "mcp2515.h"
#include "powertrain.h"
#include "shifter.h"
#include <stdio.h>
#include <string.h>
#include "FreeRTOS.h"
#include "task.h"
#include "telemetry.h"
#include "adc.h"
#include "led_fault.h"

/* CAN frame IDs — see README. Powertrain state out, force feedback in. */
#define CAN_ID_POWERTRAIN  0x0A2U /* simulated engine/gearbox state, cyclic 10 ms */
#define CAN_ID_HANDS       0x0A3U /* hands-on/off, on change + 100 ms heartbeat */
#define CAN_ID_FFB         0x0B0U /* force-feedback command in */

/*
 * Startup FFB self-test: full-scale torque hard left, then hard right, ~700 ms
 * each. The car feel is deliberately subtle, so when nothing seems to happen
 * this answers "is constant force reaching the wheel at all?" without any
 * squinting. Set 0 once force feedback is known good.
 */
#define FFB_SELFTEST 0

/* Last index of the wheel setup sequence; one past it is the settle step. */
#if FFB_SELFTEST
#define INIT_LAST 5
#else
#define INIT_LAST 2
#endif

/*
 * Honour force-feedback commands arriving on CAN 0x0B0.
 *
 * 0 because steer_feel.c owns the torque: two writers on the wheel's single
 * constant-force channel makes both useless. Kept as a flag rather than
 * deleted so the frame layout and apply_ffb() stay live and documented.
 */
#define REMOTE_FFB 0

#define PRIO_CONTROL  4
#define PRIO_USB      3
#define PRIO_CAN      2
#define PRIO_CONSOLE  1

/* Words, not bytes. Console is largest because sscanf() is stack-hungry. */
#define STACK_CONTROL 512
#define STACK_USB     512
#define STACK_CAN     256
#define STACK_CONSOLE 512

/*
 * Published by the control task, consumed by the CAN task. Both are 32-bit or
 * smaller and naturally aligned, so reads and writes are atomic on Cortex-M4 —
 * no lock needed, but they must be volatile or the compiler will cache them.
 */
static TaskHandle_t h_control, h_usb, h_can, h_console;



/* ── Serial console (PA10 RX) ───────────────────────────────────────────── */
/*
 * Line-based, polled, no interrupts — tuning force feedback needs dozens of
 * iterations and reflashing for each one is the slow way. Commands:
 *
 *   t <n>            dither torque       (0..32767)
 *   d <n>            damping gain
 *   v <n>            velocity deadband
 *   h <n>            hands-on threshold
 *   f <7 hex bytes>  send a raw FFB report, e.g. "f 11 00 ff 80 00 00 00"
 *   s                stop all effects
 *   ?                show current values
 */
static bool log_quiet;

/* 'g' console command: requested powertrain direction. Actually engaging
 * reverse still waits for the vehicle to stop -- see the interlock in
 * powertrain_tick().
 *
 * FALLBACK ONLY once an analog lever is wired to PA1: the lever is absolute
 * and wins whenever it has ever read a real detent. This is what a bench with
 * no pot fitted uses. */
static volatile bool pt_reverse_request;

/*
 * Physical lock-to-lock travel, degrees. ONE variable drives both the range
 * command sent to the wheel AND the degree conversion in the log, because
 * those two disagreeing is a silent lie: the firmware used to ask the wheel
 * for 900 while the log divided by 180, so a wheel that HAD unlocked to 900
 * would still have printed +-180 and looked locked.
 *
 * Whether the wheel honours it is a separate question — this unit runs in
 * C294 compat mode (see README) and `f8 81` is a G25+ native command. Set it
 * live with 'R' and turn the wheel to the stops to find out what it actually
 * gives you: the steer= reading saturates at the true mechanical limit
 * regardless of what we asked for.
 */
static int32_t steer_range = 900;

/*
 * Wheel setup timing. The FFB queue is a single overwriting slot, so setup is
 * gated on delivery confirmation rather than on a guessed delay — see the
 * ack-gate comment in control_task().
 *
 * SETTLE lets the interrupt-OUT pipe become serviceable before the first
 * command is queued; ACK_TIMEOUT bounds how long a single step may wait for
 * its URB to complete before setup gives up on it and moves on.
 */
#define SETUP_SETTLE_MS      600U
#define SETUP_ACK_TIMEOUT_MS 500U

