Islam-ElShahaby/STM32-G29/src/main.c
/*
 * Re-assert the setup a few times after start-up.
 *
 * The ack gate proved delivery is no longer the problem: at boot the range
 * command completes with USBH_URB_DONE and the wheel STILL keeps its narrow
 * travel. So it is acked and ignored — the wheel's own FFB engine evidently
 * is not ready to act on a range command that arrives moments after
 * enumeration, even though the endpoint accepts it.
 *
 * There is no way to read the range back, so the robust answer is to say it
 * again once the wheel has definitely finished waking up. Cheap: each re-send
 * costs one 10 ms torque update.
 */
#define SETUP_REASSERTS   4
#define SETUP_REASSERT_MS 2000U

/*
 * Set by the 'R' console command to re-run the ack-gated setup sequence.
 *
 * 'R' must NOT call g29_send_range() directly: that drops the report into the
 * same single overwriting slot the 100 Hz torque loop is already writing every
 * tick, so it would be clobbered before delivery just as often as the original
 * init-time race was. Routing it through the setup state machine is what makes
 * a live range change actually stick.
 */
static volatile bool setup_redo_request;

/*
 * Command dispatch. Steering-feel knobs are NOT handled here — they belong to
 * steer_feel.c and stay private to it; this tries them first via
 * steer_feel_console() and only then falls through to the app-level commands
 * (range, gear, task stacks, log). Adding a feel knob therefore touches one
 * file, not two.
 */
static void console_exec(char *line)
{
	long v = 0;
	char c = line[0];

	/* Single-letter knobs that take a number. */
	if (c && strchr("tvhpiraenymocbCuxRg", c) != NULL) {
		if (sscanf(line + 1, "%ld", &v) != 1) {
			printf("? need a number\r\n");
			return;
		}

		if (steer_feel_console(c, v)) {
			printf("ok ");
			steer_feel_print_values();
			return;
		}

		switch (c) {
		case 'R':
			/* Same 40..900 clamp the wheel API enforces, so the degree
			 * conversion can never disagree with what was actually
			 * sent. Delivery is handed to the ack-gated setup sequence,
			 * NOT sent directly — see setup_redo_request. */
			steer_range = (v < 40) ? 40 : ((v > 900) ? 900 : v);
			setup_redo_request = true;
			printf("ok range=%ld deg requested, re-running setup...\r\n",
			       (long)steer_range);
			return;

		case 'g':
			pt_reverse_request = (v != 0);
			printf("ok gear=%s (engages once stopped)\r\n",
			       pt_reverse_request ? "R" : "D");
			return;

		default:
			printf("? unhandled '%c'\r\n", c);
			return;
		}
	}

	switch (c) {
	case 'f': {
		unsigned b[7] = {0};
		int n = sscanf(line + 1, "%x %x %x %x %x %x %x",
			       &b[0], &b[1], &b[2], &b[3], &b[4], &b[5], &b[6]);
		uint8_t cmd[7];

		if (n < 1) {
			printf("? need hex bytes\r\n");
			return;
		}
		for (int i = 0; i < 7; i++) {
			cmd[i] = (uint8_t)b[i];
		}
		printf("raw -> %02X %02X %02X %02X %02X %02X %02X (%d given)\r\n",
		       cmd[0], cmd[1], cmd[2], cmd[3], cmd[4], cmd[5], cmd[6], n);
		g29_send_raw(cmd);
		break;
	}

	case 'k': {
		/* Words still unused at each task's deepest point so far, plus free
		 * heap. Check this before adding tasks — the numbers are what say
		 * whether there is room, rather than guessing at stack sizes. */
		struct { const char *n; TaskHandle_t h; int size; } t[] = {
			{ "control", h_control, STACK_CONTROL },
			{ "usb",     h_usb,     STACK_USB     },
			{ "can",     h_can,     STACK_CAN     },
			{ "console", h_console, STACK_CONSOLE },
		};

		printf("task      stack  free(words)\r\n");
		for (unsigned i = 0; i < sizeof(t) / sizeof(t[0]); i++) {
			printf("  %-8s %5d  %5u\r\n", t[i].n, t[i].size,
			       (unsigned)uxTaskGetStackHighWaterMark(t[i].h));
		}
		printf("heap free %u of %u bytes, log dropped %lu\r\n",
		       (unsigned)xPortGetFreeHeapSize(),
		       (unsigned)configTOTAL_HEAP_SIZE,
		       (unsigned long)log_dropped);
		break;
	}

	case 's':
		steer_feel_stop();
		printf("stopped\r\n");
		break;

	case 'S':
		log_quiet = true;          /* the periodic log would corrupt the CSV */
		steer_feel_sysid_start();
		printf("sid,begin\r\n");
		break;

	case 'q':
		log_quiet = !log_quiet;
		printf("log %s\r\n", log_quiet ? "off" : "on");
		break;

	case '?':
		steer_feel_print_values();
		steer_feel_print_help();
		printf("  R=lock-to-lock range in deg, 40..900 (also fixes the steer= scale)\r\n"
		       "  g <0|1>=powertrain direction request, D or R (engages once stopped)\r\n"
		       "  S=step-id  k=task stacks  f <hex..>  s  q  ?\r\n");
		break;

	default:
		printf("? unknown '%c'\r\n", c);
		break;
	}
}

/*
 * RX is interrupt-driven, not polled.
 *
 * The F4 USART has a ONE-BYTE receive register and no FIFO. At 115200 a
 * character lands every 87 us, so a task polling RXNE every few milliseconds
 * loses all but the last byte of a command and latches the overrun flag. The
 * old kHz main loop got away with polling; a scheduled task cannot.
 */
#define RX_BUF_SZ 64U             /* power of two: the mask below depends on it */

static volatile char rx_buf[RX_BUF_SZ];
static volatile uint8_t rx_head, rx_tail;

void USART1_IRQHandler(void)
{
	USART_TypeDef *u = huart1.Instance;
	uint32_t sr = u->SR;

	if (sr & (USART_SR_RXNE | USART_SR_ORE)) {
		/* Reading DR after SR clears RXNE and, importantly, ORE — leaving
		 * ORE set would wedge reception permanently. */
		char ch = (char)(u->DR & 0xFFU);
		uint8_t next = (uint8_t)((rx_head + 1U) & (RX_BUF_SZ - 1U));

		if (next != rx_tail) {         /* drop when full, never block */
			rx_buf[rx_head] = ch;
			rx_head = next;
		}
	}
}

/* Drain the receive ring; dispatch on newline. */
static void console_poll(void)
{
	static char buf[48];
	static uint8_t len;

	while (rx_tail != rx_head) {
		char ch = rx_buf[rx_tail];

		rx_tail = (uint8_t)((rx_tail + 1U) & (RX_BUF_SZ - 1U));

		if (ch == '\r' || ch == '\n') {
			if (len) {
				buf[len] = '\0';
				len = 0;
				console_exec(buf);
			}
		} else if (len < sizeof(buf) - 1) {
			buf[len++] = ch;
		}
	}
}

/* ── CAN ────────────────────────────────────────────────────────────────── */
/* Dispatch a 0x0B0 command frame onto the existing FFB API in g29_hid.h. */
static void apply_ffb(const struct can_frame *f)
{
	if (f->dlc < 1U) {
		return;
	}

	switch (f->data[0]) {
	case 0x00:
		g29_send_no_effect();
		break;
	case 0x01:
		if (f->dlc >= 3U) {
			g29_send_constant_force(
				(int16_t)((uint16_t)f->data[1] |
					  ((uint16_t)f->data[2] << 8)));
		}
		break;
	case 0x02:
		if (f->dlc >= 3U) {
			g29_send_autocenter(f->data[1], f->data[2]);
		}
		break;
	case 0x03:
		if (f->dlc >= 3U) {
			g29_send_range((uint16_t)f->data[1] |
				       ((uint16_t)f->data[2] << 8));
		}
		break;
	default:
		break;   /* unknown command: ignore, next frame is 10 ms away */
	}
}

/* ── Tasks ──────────────────────────────────────────────────────────────── */
/*
 * Priorities (higher number wins). Every task blocks, so nothing starves.
 *
 *   4 control  10 ms periodic — torque, car feel, hands-on. Highest because a
 *              late torque update is the one thing that is actually felt.
 *   3 usb      services the host stack. It cannot block on an event: the G29
 *              class polls URB state (see g29_hid.c), so USBH_USE_OS stays 0
 *              and this runs on a 1 ms tick instead. That is ample against a
 *              10 ms report interval, and it yields so the rest can run.
 *   2 can      10 ms periodic — cyclic frames out, force-feedback frames in.
 *   1 console  drains the log ring and parses commands. Lowest on purpose:
 *              serial output must never delay torque.
 */
static volatile bool     shared_ready;
static volatile bool     shared_hands_on;
static volatile uint16_t shared_steering;
static volatile uint8_t  shared_throttle, shared_brake, shared_clutch;
static volatile uint32_t shared_buttons;
static volatile uint8_t  shared_lights_state;   /* packed, CAN-frame bit order */

