Islam-ElShahaby/STM32-G29/src/main.c
/*
 * Powertrain sim output, published by control_task (which already reads the
 * pedals every tick) and consumed by can_task/console_task. One writer, and
 * each field is naturally aligned and <=32 bits, so — same reasoning as the
 * pedal/steering shares above — no lock is needed, just volatile.
 */
static volatile uint16_t shared_pt_rpm, shared_pt_speed;
static volatile uint8_t  shared_pt_gear;
static volatile bool     shared_pt_reverse;
static volatile uint8_t  shared_shifter;	/* enum shifter_mode */

/*
 * Road speed at or below which selecting P engages the pawl. Above it P coasts
 * like N — see the powertrain tick in control_task().
 */
#define PARK_PAWL_KMH 5

static void usb_task(void *arg)
{
	(void)arg;
	for (;;) {
		MX_USB_HOST_Process();
		vTaskDelay(pdMS_TO_TICKS(1));
	}
}

static void control_task(void *arg)
{
	TickType_t next = xTaskGetTickCount();
	uint32_t last_blink = 0;
	uint32_t t_init = 0;
	uint32_t init_hold = SETUP_SETTLE_MS;
	uint8_t  init_step = 0;
	uint8_t  pt_div = 0;
	uint32_t setup_mark = 0;	/* ffb_sent when the step was queued */
	bool     setup_waiting = false;	/* queued, not yet confirmed on the wire */
	bool     setup_announced = false;
	uint8_t  setup_reasserts = SETUP_REASSERTS;
	uint32_t t_reassert = 0;

	(void)arg;

	powertrain_init();

	for (;;) {
		struct g29_state st = {0};
		bool ready = g29_get_state(&st) == 0;
		bool setup_done;
		bool hands_on = false;
		uint32_t ffb_ok, ffb_nak, ffb_err;

		g29_ffb_stats(&ffb_ok, &ffb_nak, &ffb_err);

		if (ready) {
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); /* solid */

			/* 'R' asked for a different range: replay setup so the new
			 * value is delivered under the same ack gate. */
			if (setup_redo_request) {
				setup_redo_request = false;
				init_step = 0;
				init_hold = 0;   /* pipe is already up; no settle needed */
				setup_waiting = false;
				setup_announced = false;
			}

			/*
			 * One-shot wheel setup — ACK-GATED, not timer-gated.
			 *
			 * queue_ffb() in g29_hid.c is a SINGLE slot and overwrites
			 * unconditionally. Advancing on a fixed 50 ms delay meant that
			 * whenever the range command's OUT transfer had not completed
			 * in time, the next step overwrote and destroyed it — and once
			 * the 100 Hz torque loop starts it owns the queue, so the range
			 * never got another chance. The wheel then kept its default
			 * narrow travel. That race is exactly why full lock-to-lock
			 * came up only SOMETIMES.
			 *
			 * So a step is only retired once g29_ffb_stats()'s sent counter
			 * actually advances, which happens on USBH_URB_DONE — proof the
			 * report reached the wheel. SETUP_ACK_TIMEOUT_MS stops a wedged
			 * endpoint from stalling setup for ever.
			 */
			if (init_step <= INIT_LAST) {
			    if (setup_waiting) {
				if (ffb_ok != setup_mark) {
					setup_waiting = false;
					t_init = HAL_GetTick();
					init_step++;
				} else if (HAL_GetTick() - t_init >= SETUP_ACK_TIMEOUT_MS) {
					printf("setup step %u NOT acked in %u ms — "
					       "wheel may keep default range\r\n",
					       init_step, SETUP_ACK_TIMEOUT_MS);
					setup_waiting = false;
					t_init = HAL_GetTick();
					init_step++;
				}
			    } else if (HAL_GetTick() - t_init >= init_hold) {
				/* Not every step queues a report — the trailing
				 * settle step sends nothing, and gating that on an
				 * ack that can never arrive just burns the timeout
				 * and prints a bogus warning. */
				bool queued = true;

				switch (init_step) {
				case 0:
					/* Kill the default centring spring. It is ON at
					 * power-up and is what drags the wheel back to
					 * centre — nothing in this file does that. */
					g29_send_autocenter(0, 0);
					break;
				case 1:
					/* Unlock the full travel. Deliberately sent LAST:
					 * if any earlier command resets the range as a
					 * side effect, ordering it after them means the
					 * range is what survives. Re-sent on every
					 * re-enumeration, since the wheel forgets it, and
					 * re-asserted a few times after boot because this
					 * wheel acks-but-ignores an early one. */
					g29_send_range((uint16_t)steer_range);
					break;
#if FFB_SELFTEST
				case 2:
					printf("FFB self-test: hard LEFT\r\n");
					g29_send_constant_force(-32767);
					break;
				case 3:
					printf("FFB self-test: hard RIGHT\r\n");
					g29_send_constant_force(32767);
					break;
				case 4:
					printf("FFB self-test: done\r\n");
					g29_send_constant_force(0);
					break;
#endif
				default:
					queued = false;   /* pure settle, nothing sent */
					break;
				}
				/* Self-test steps have to be held long enough to *feel*;
				 * setup steps only need the single-slot queue to drain. */
				init_hold = (init_step == 2U || init_step == 3U) ? 700U : 50U;
				t_init = HAL_GetTick();
				if (queued) {
					setup_mark = ffb_ok;
					setup_waiting = true;
				} else {
					init_step++;
				}
			    }
			}
		} else {
			init_step = 0;        /* wheel unplugged: re-run setup on return */
			/* Settle before the first command: the OUT pipe is not
			 * necessarily serviceable the instant reports start arriving,
			 * and a range command queued too early is one the ack gate
			 * above would only discover had been lost. */
			init_hold = SETUP_SETTLE_MS;
			setup_waiting = false;
			/* A replugged wheel is a freshly woken wheel: it needs the
			 * same re-assertion as a cold boot. */
			setup_reasserts = SETUP_REASSERTS;
			t_reassert = HAL_GetTick();
			t_init = HAL_GetTick();
			if (HAL_GetTick() - last_blink >= 200) {
				HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
				last_blink = HAL_GetTick();
			}
		}

		setup_done = init_step > INIT_LAST;

		/*
		 * Say the range again a few times after start-up. The ack gate
		 * already proves the first one was delivered, so this is aimed at
		 * the wheel ACTING on it: an early range command is acked and
		 * ignored, and one sent a couple of seconds later sticks.
		 * Re-running the whole sequence also re-asserts autocenter-off.
		 */
		if (ready && setup_done && setup_reasserts > 0 &&
		    HAL_GetTick() - t_reassert >= SETUP_REASSERT_MS) {
			printf("re-asserting range=%ld (%u left)\r\n",
			       (long)steer_range, setup_reasserts - 1U);
			setup_reasserts--;
			t_reassert = HAL_GetTick();
			init_step = 0;
			init_hold = 0;      /* pipe is long since up */
			setup_waiting = false;
			/* setup_announced left set: this is a re-assert, not news. */
		}

