Islam-ElShahaby/STM32-G29/src/main.c
		/* Announce once, edge-triggered: this is the line that says whether
		 * the range command was actually delivered, which is the difference
		 * between full travel and the wheel's default narrow lock. */
		if (ready && setup_done && !setup_announced) {
			setup_announced = true;
			printf("wheel setup done: range=%ld deg delivered to the wheel "
			       "(turn to the stops; steer= reaches +-%ld only if the "
			       "wheel honours it)\r\n",
			       (long)steer_range, (long)(steer_range / 2));
		}
		if (!ready) {
			setup_announced = false;
		}

		/* One call: steer_feel owns the torque and arbitrates internally
		 * between the bring-up sweep, the identification and the normal
		 * feel loop. Gated on setup_done so the 100 Hz torque stream never
		 * starts before the range/autocenter commands have been delivered
		 * — they share the wheel's single FFB slot. */
		if (ready && setup_done) {
			hands_on = steer_feel_update(st.steering);
		}

		shared_steering = st.steering;
		shared_throttle = st.throttle;
		shared_brake    = st.brake;
		shared_clutch   = st.clutch;
		shared_buttons  = st.buttons;
		shared_hands_on = hands_on;
		shared_ready    = ready;

		/*
		 * Single source of truth for the 4 light toggle states -- see
		 * lights_toggle_update()'s comment in telemetry.h. Computed
		 * once here, consumed two ways: packed for the CAN lights
		 * frame (shared_lights_state, sent from can_task), and
		 * directly for led_fault_update()'s gating below, in the
		 * same tick, same task -- no re-derivation, no drift between
		 * the two consumers.
		 */
		{
    bool left_on  = false;
    bool right_on = false;
    bool low_on   = false;
    bool high_on  = false;

    bool left_out  = false;
    bool right_out = false;
    bool low_out   = false;
    bool high_out  = false;


    /*
     * ================================================================
     * STARTUP LED SELF-TEST
     * ================================================================
     *
     * led_fault.c owns the self-test state machine.
     *
     * It does NOT directly access GPIOs.
     *
     * Instead it tells us which physical LED should be ON. This task
     * then remains the sole owner of lights_gpio_set().
     */
    if (led_fault_selftest_running())
    {
        /*
         * Advance the self-test state machine.
         *
         * The four arguments are ignored while the self-test is active.
         */
        led_fault_update(
            false,
            false,
            false,
            false
        );


        /*
         * Obtain the output requested by the self-test.
         */
        led_fault_selftest_outputs(
            &left_out,
            &right_out,
            &low_out,
            &high_out
        );


        /*
         * Drive the physical LEDs.
         *
         * No blink gating is applied here because the self-test must
         * produce a steady electrical load.
         */
        lights_gpio_set(
            left_out,
            right_out,
            low_out,
            high_out,
            NULL,
            NULL,
            NULL,
            NULL
        );
    }
    else
    {
        /*
         * ============================================================
         * NORMAL LIGHT OPERATION
         * ============================================================
         */

        /*
         * Calculate the commanded light states.
         */
        shared_lights_state =
            lights_toggle_update(
                st.buttons,
                &left_on,
                &right_on,
                &low_on,
                &high_on
            );


        /*
         * Apply indicator blinking and physically drive the outputs.
         *
         * left_out/right_out represent the ACTUAL physical GPIO state.
         */
        lights_gpio_set(
            left_on,
            right_on,
            low_on,
            high_on,
            &left_out,
            &right_out,
            &low_out,
            &high_out
        );


        /*
         * Fault monitor sees the ACTUAL physical state.
         *
         * This is important for the blinking indicators:
         *
         *     left_on  = commanded ON
         *     left_out = physically ON right now
         *
         * During the 500 ms OFF part of the blink:
         *
         *     left_on  = true
         *     left_out = false
         *
         * Therefore the ADC monitor correctly freezes during that time.
         */
        led_fault_update(
            left_out,
            right_out,
            low_out,
            high_out
        );
    }
}

		/*
		 * Powertrain sim: FEEL_MS (10 ms) x2 = PT_TICK_MS (20 ms), the
		 * period its drag/shift-timing constants are tuned against.
		 * Cheap integer math (one array lookup, a handful of
		 * multiplies) — negligible next to steer_feel_update() above, so it
		 * doesn't threaten the torque loop this task exists for.
		 */
		if (++pt_div >= (uint8_t)(PT_TICK_MS / FEEL_MS)) {
			struct powertrain_state pt;
			enum shifter_mode sel;
			uint8_t thr = (uint8_t)((uint32_t)st.throttle * 100U / 255U);
			uint8_t brk = (uint8_t)((uint32_t)st.brake * 100U / 255U);

			pt_div = 0;

			/*
			 * The lever owns the gear whenever one is wired. 'g'
			 * stays as the fallback for a bench with nothing on PA1
			 * — see shifter_update() for why that is decided by
			 * having seen a real detent rather than by a #define.
			 */
			if (!shifter_update(&sel)) {
				sel = pt_reverse_request ? SHIFTER_R : SHIFTER_D;
			}
			shared_shifter = (uint8_t)sel;

			/*
			 * powertrain.c now models N/P directly via the neutral
			 * flag to powertrain_tick() -- see neutral_tick() there.
			 * Throttle is passed through UNCHANGED (previously
			 * forced to 0 here, which is why RPM used to just decay
			 * in N/P regardless of the pedal instead of free-revving
			 * the way a disconnected gearbox actually behaves).
			 *
			 * P: a parking pawl, not a brake. It only holds once
			 * the car is already stopped — forcing full brake at
			 * any speed would turn selecting P into an emergency
			 * stop, which is not what the lever does in a real car
			 * (the pawl simply refuses to engage above walking
			 * pace). Above that it behaves as N.
			 */
			bool neutral = (sel == SHIFTER_N || sel == SHIFTER_P);

			if (sel == SHIFTER_P && shared_pt_speed <= PARK_PAWL_KMH) {
				brk = 100;
			}

			powertrain_tick(thr, brk, sel == SHIFTER_R, neutral);
			powertrain_get_state(&pt);
			shared_pt_rpm     = pt.engine_rpm;
			shared_pt_speed   = pt.speed_kmh;
			shared_pt_gear    = pt.gear;
			shared_pt_reverse = pt.reverse;
		}

