Islam-ElShahaby/STM32-G29/src/main.c
		/*
		 * Absolute deadline, not a relative delay: vTaskDelayUntil keeps the
		 * period fixed even when an iteration runs long, so the velocity
		 * estimate stays valid. It is a difference over a FIXED interval, and
		 * a drifting interval would silently scale every gain in the car-feel
		 * model.
		 */
		vTaskDelayUntil(&next, pdMS_TO_TICKS(FEEL_MS));
	}
}


static void can_task(void *arg)
{
    TickType_t next = xTaskGetTickCount();
    (void)arg;

    for (;;) {
        /*
         * Execute CAN telemetry routine (10 ms periodic + event-triggered on hands state change).
         * This handles packing RPM, Speed, Gear, Hands-On/Off status, and the rolling counter.
         *
         * shared_shifter is published by control_task() every FEEL_MS tick;
         * telemetry needs the real PRND selection (not just what
         * powertrain.c's D/R-only state can express) so the CAN Mode byte
         * can report N and P correctly -- see the fix in telemetry.c.
         */
        /*
         * shared_hands_on is the real hod_update() verdict, published by
         * control_task() every FEEL_MS tick -- see the parameter comment in
         * telemetry.h for why this has to be passed in rather than
         * re-derived inside can_telemetry_update() itself.
         */
        can_telemetry_update((enum shifter_mode)shared_shifter, shared_hands_on);

		can_lights_update(shared_lights_state,
                  get_led_fault_state(),
                  shared_buttons);




        /*
         * Force feedback frame drain from MCP2515 buffer (to prevent hardware RX buffer overflow)
         */
        struct can_frame rx;
        if (shared_ready && mcp2515_recv(&rx) == 0 && rx.id == CAN_ID_FFB && REMOTE_FFB) {
            apply_ffb(&rx);
        }

        vTaskDelayUntil(&next, pdMS_TO_TICKS(10));
    }
}


/*
 * CPU load over the interval between two console lines, in permille.
 *
 * Both counters run on the DWT cycle counter, so this is the idle task's real
 * share of the elapsed time, not a guess from loop counts. Unsigned differences
 * survive the ~51 s CYCCNT wrap; the kernel drops the single slice that spans
 * the wrap (tasks.c only accumulates when the counter moved forward), so once
 * every 51 s the figure can read a hair high. Not worth a 64-bit counter.
 */
static unsigned cpu_load_permille(void)
{
	static uint32_t last_idle, last_cyc;
	uint32_t idle = ulTaskGetIdleRunTimeCounter();
	uint32_t cyc  = portGET_RUN_TIME_COUNTER_VALUE();
	uint32_t d_idle = idle - last_idle;
	uint32_t d_cyc  = cyc - last_cyc;
	/* d_cyc is ~84e6 for a 1 s window, so busy*1000 would overflow 32 bits —
	 * scale the divisor instead of the dividend. */
	uint32_t per_mille = d_cyc / 1000U;

	last_idle = idle;
	last_cyc  = cyc;

	if (per_mille == 0U || d_idle >= d_cyc) {
		return 0;
	}
	return (unsigned)((d_cyc - d_idle) / per_mille);
}

/*
 * "OK"/"OPEN"/"SHORT" for the console line below. Fixed width (5 chars,
 * space-padded) so the four LED fields line up column-to-column across
 * prints instead of the line length jittering with the verdict.
 */
static const char *led_fault_str(led_fault_state_t s)
{
	switch (s) {
	case LED_OK:    return "OK   ";
	case LED_OPEN:  return "OPEN ";
	case LED_SHORT: return "SHORT";
	default:        return "?    ";
	}
}

static void console_task(void *arg)
{
	uint32_t last_log = 0;

	(void)arg;

	for (;;) {
		console_poll();
		log_flush();

		/* Keep the load baseline fresh while the line is not being printed
		 * ('q', or no wheel yet): a silence longer than the ~51 s CYCCNT
		 * wrap would otherwise make the first line after it read nonsense. */
		if (log_quiet || !shared_ready) {
			(void)cpu_load_permille();
		}

		if (shared_ready && !log_quiet &&
		    HAL_GetTick() - last_log >= 1000) {
			uint32_t sent, nak, err;
			struct steer_feel_telemetry sf;

			steer_feel_get_telemetry(&sf);
			/* 0..0xFFFF -> +-(steer_range/2) deg. Driven by the same
			 * variable as the range command, so the reading means
			 * what it says whatever the wheel is set to. */
			int32_t deg = ((int32_t)shared_steering - 32768) *
				      (steer_range / 2) / 32768;

			/*
			 * gear= mode letter. powertrain.c only models D and R —
			 * shared_pt_reverse can never say N or P — so in those two
			 * modes it was reporting whatever forward/reverse gear the
			 * sim last held (e.g. "gear=D1" while the shifter sat in
			 * P, or a stale "gear=R0" for several ticks after leaving
			 * R). Take the mode letter from the actual shifter
			 * selection instead; only fall back to the sim's own D/R
			 * call when the selector really is in D or R, since that
			 * is the one distinction the sim tracks correctly (e.g.
			 * the R->D interlock holding "R0" until speed_accum hits
			 * zero is real state, not a display bug).
			 */
			enum shifter_mode sel_now = (enum shifter_mode)shared_shifter;
			char gear_mode_c = (sel_now == SHIFTER_N || sel_now == SHIFTER_P)
					   ? shifter_letter(sel_now)
					   : (shared_pt_reverse ? 'R' : 'D');

			unsigned load = cpu_load_permille();

			g29_ffb_stats(&sent, &nak, &err);
			printf("steer=%+4ld thr=%3u brk=%3u btn=%08lX "
			       "vel=%+5d force=%+6d ctr=%+6d p2p=%5u hands=%d "
			       "sel=%c shf=%4u gear=%c%u rpm=%4u spd=%3u "
			       "cpu=%u.%u%% "
			       "ffb[ok=%lu nak=%lu err=%lu]%s\r\n",
			       (long)deg, shared_throttle, shared_brake,
			       (unsigned long)shared_buttons, sf.vel, sf.force,
			       sf.centre, sf.p2p, (int)shared_hands_on,
			       shifter_letter(sel_now),
			       shifter_raw(),
			       gear_mode_c, shared_pt_gear,
			       shared_pt_rpm, shared_pt_speed,
			       load / 10U, load % 10U,
			       (unsigned long)sent, (unsigned long)nak,
			       (unsigned long)err,
			       log_dropped ? "  [log overflow]" : "");

			/*
			 * LED fault line: state + raw mV for all 4 lights, same
			 * 1 s cadence as the line above. led_fault_get()/
			 * led_fault_voltage() are plain reads of state
			 * control_task() computed via led_fault_update() -- safe
			 * to call from console_task() too, same as can_task()
			 * already does for the CAN fault frame (see
			 * can_led_fault_update() in telemetry.c). LED index
			 * order matches led_fault.c: 0=left, 1=right, 2=low
			 * beam, 3=high beam.
			 */
			printf("led: L=%s(%4umV) R=%s(%4umV) "
			       "LO=%s(%4umV) HI=%s(%4umV)\r\n",
			       led_fault_str(led_fault_get(0)), led_fault_voltage(0),
			       led_fault_str(led_fault_get(1)), led_fault_voltage(1),
			       led_fault_str(led_fault_get(2)), led_fault_voltage(2),
			       led_fault_str(led_fault_get(3)), led_fault_voltage(3));

			last_log = HAL_GetTick();
		}

		vTaskDelay(pdMS_TO_TICKS(5));
	}
}

int main(void)
{
	HAL_Init();
	board_init();

	printf("\r\n=== G29 USB host (STM32 BlackPill, FreeRTOS) ===\r\n");

	MX_USB_HOST_Init();

	printf("MCP2515: %s\r\n", mcp2515_init() == 0 ? "ok" : "not responding");

adc_init();

/* GPIO must be initialized before the LED self-test starts. */
lights_gpio_init();

led_fault_init();

/*
 * Start the non-blocking LED electrical self-test.
 *
 * The actual GPIO outputs are driven from control_task().
 */
led_fault_selftest_start();

	/* Nothing has drained the ring yet — push the banner out synchronously so
	 * a failure before the scheduler starts is still visible. */
	while (log_flush() != 0) {
	}

	xTaskCreate(control_task, "control", STACK_CONTROL, NULL, PRIO_CONTROL, &h_control);
	xTaskCreate(usb_task,     "usb",     STACK_USB,     NULL, PRIO_USB,     &h_usb);
	xTaskCreate(can_task,     "can",     STACK_CAN,     NULL, PRIO_CAN,     &h_can);
	xTaskCreate(console_task, "console", STACK_CONSOLE, NULL, PRIO_CONSOLE, &h_console);

	vTaskStartScheduler();

	/* Only reached if the heap was too small for the tasks above. */
	for (;;) {}
}